ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p65x_mcanss_regs.xml
<module id="MCANSS_REGS" HW_revision="" description="MCANSS Registers">
	<register id="MCANSS_PID" width="32" page="1" offset="0x0" internal="0" description="MCAN Subsystem Revision Register">
		<bitfield id="MINOR" description="Minor Revision" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="MCANSS_CTRL" width="32" page="1" offset="0x4" internal="0" description="MCAN Subsystem Control Register">
		<bitfield id="DBGSUSP_FREE" description="Debug Suspend Free" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="WAKEUPREQEN" description="Wakeup Request Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="AUTOWAKEUP" description="Automatic Wakeup Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EXT_TS_CNTR_EN" description="External Timestamp Counter Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANSS_STAT" width="32" page="1" offset="0x8" internal="0" description="MCAN Subsystem Status Register">
		<bitfield id="RESET" description="Soft Reset Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MEM_INIT_DONE" description="Memory Initialization Done" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ENABLE_FDOE" description="Flexible Datarate Operation Enable" begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="MCANSS_ICS" width="32" page="1" offset="0xc" internal="0" description="MCAN Subsystem Interrupt Clear Shadow Register">
		<bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Status Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANSS_IRS" width="32" page="1" offset="0x10" internal="0" description="MCAN Subsystem Interrupt Raw Satus Register">
		<bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Status" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANSS_IECS" width="32" page="1" offset="0x14" internal="0" description="MCAN Subsystem Interrupt Enable Clear Shadow Register">
		<bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANSS_IE" width="32" page="1" offset="0x18" internal="0" description="MCAN Subsystem Interrupt Enable Register">
		<bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANSS_IES" width="32" page="1" offset="0x1c" internal="0" description="MCAN Subsystem Interrupt Enable Status">
		<bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="MCANSS_EOI" width="32" page="1" offset="0x20" internal="0" description="MCAN Subsystem End of Interrupt">
		<bitfield id="EOI" description="External Timestamp Counter Overflow End of Interrupt" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="MCANSS_EXT_TS_PRESCALER" width="32" page="1" offset="0x24" internal="0" description="MCAN Subsystem External Timestamp Prescaler 0">
		<bitfield id="PRESCALER" description="External Timestamp Prescaler" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="MCANSS_EXT_TS_UNSERVICED_INTR_CNTR" width="32" page="1" offset="0x28" internal="0" description="MCAN Subsystem External Timestamp Unserviced Interrupts Counter">
		<bitfield id="EXT_TS_INTR_CNTR" description="External Timestamp Counter Unserviced Rollover Interrupts" begin="4" end="0" width="5" rwaccess="R"/>
	</register>
</module>
